Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: སྡིག་པར་ལྟ་བ་འདི་ལྟ་བུ། །ཡང་དང་ཡང་དུ་བསྟེན་པས་ན། ། གཅིག་ཏུ་མི་བཟད་མ་རུངས་པའི། །སེམས་ཅན་དམྱལ་བར་རིང་དུ་དེངས།
en: “Adhering to evil views like these, Over and over again, One will be cast into terrible hells Where nothing but unrelenting heat awaits.

source: །རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་གྱི། །ཡོངས་སུ་འདྲེན་པ་མ་མཐོང་བས། །བདག་གི་ལུས་ནི་སྟོང་རྣམས་ཀྱང་། །ངན་འགྲོ་དག་ནི་གསུམ་དུ་དེངས། །འདི་ནི་འཇིག་རྟེན་དགེ་བ་སྟེ། །
en: “One will be cast into the three lower realms For thousands of existences, Having no regard for the perfect Buddha, Who is a guide for the world. “Now that the excellent one is present in the world,

source: དེ་ཡི་སྒྲ་ནི་ཐོས་གྱུར་ནས། །
en: Now that I have heard his words

source: བདག་གིས་མི་ཡི་དངོས་ཐོབ་ཀྱིས། །བཟང་པོ་ཡི་ནི་ལས་བྱའོ། །
en: And have attained a human existence, I will act in virtuous ways.

source: མིར་འགྱུར་བ་ནི་དཀའ་བ་སྟེ། །
en: “It is difficult to attain the human state.

source: མི་སྲོག་ཐོབ་པའང་དཀའ་བ་ཡིན། །
en: It is difficult to be born as a mortal man.

source: དམ་པའི་ཆོས་ཐོས་དཀའ་བ་སྟེ། །
en: It is difficult to hear the true Dharma.

source: སངས་རྒྱས་འབྱུང་བའང་དཀའ་བ་ཡིན། །
en: It is difficult to for a buddha to appear.

source: བདག་གིས་མིར་སྐྱེ་དཀའ་བ་ཡི། །ཚེ་ཐོབ་པ་ནི་གཡོ་ཞིང་འགྱུར། །
en: “With difficulty I have become a human being, A life I cannot be certain to hold on to.

source: བདག་གིས་སངས་རྒྱས་འབྱུང་བ་དང་། །རྒྱལ་བ་ཀུན་མཁྱེན་བསྟན་པ་རྙེད། །
en: A buddha has arisen, And I have received teachings from an omniscient victorious one.

source: ལུས་ཀྱི་ལས་དང་ངག་གི་ལས། །ཡིད་ཀྱི་ལས་ཀྱང་སྡིག་པ་ཅན། །མི་འདོད་མི་ཟད་འབྲས་བུར་འགྱུར། །ཕྱིན་ཅད་སྤྱད་པར་མི་བྱའོ། །
en: “Never again will I engage In evil acts of body, speech, or mind, The fruits of which Are intolerable torture.

source: བསམ་པ་རྣམ་པར་དག་པ་ཡི། །ལུས་དང་ངག་དང་ཡིད་རྣམས་ཀྱིས། །འཇིག་རྟེན་རབ་ཏུ་དཀའ་སྤྱོད་པ། །བཟང་པོ་དག་གི་ལས་བྱའོ། །
en: “With my motivation completely pure, I will engage in excellent acts Of body, speech, and mind, Even though such acts are difficult to perform in this world.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །བདག་གི་བླ་མར་གང་གྲགས་པའི། །བཀའ་ལས་འདའ་བར་མི་བྱ་སྟེ། ། བསྙེན་བཀུར་དག་ནི་རབ་ཏུ་བྱ། །
en: “I will not go against the commands Of my esteemed teacher But will venerate him In order to realize awakening.

source: ལམ་ནི་དྲང་པོ་ཞེས་བྱ་བ། །གཡོ་མེད་པས་ནི་རབ་བསྟན་ཏེ། །
en: “The path for those who are straightforward Is revealed without any duplicity.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །སྒྱུ་མར་འགྱུར་བར་མི་བྱའོ། །
en: In order to realize awakening, I will not engage in any form of deceit.

source: ཐབས་དང་ཤེས་རབ་ལྡན་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་མི་འཇིགས་པ། །དེ་ལྟ་བུར་ནི་སེམས་བསྐྱེད་ནས། །སྣོད་གང་ཙམ་གྱི་ཆུ་ཡང་འབུལ། །
en: “Thinking in this way, The bodhisatva who has perfected wisdom and skillful means Will be ready to give up his water flask Without a second thought.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་ལྔ་པ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ་ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the fifth thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་སྡིག་པའི་གྲོགས་པོས་ཟིན་པས། འདུད་པ་དང་། རབ་ཏུ་འདུད་པ་དང་། གུས་པར་སྨྲ་བ་དང་། ཕྱག་བྱ་བ་དང་། ལྡང་བ་དང་། ཐལ་མོ་སྦྱར་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་དོ། ། ཞེས་དེ་ལྟར་མོས་པའི་བར་གྱིས་ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པས་སྡིག་པ་མི་དགེ་བའི་ལས་མང་པོ་མངོན་པར་འདུས་བྱས་ཏེ། མི་དགེ་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། འདི་ལྟ་སྟེ། མིའི་ནང་དུ་སྦྱིན་གནས་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་མ་ཡིན་པ་སྨད་པའི་ལུས་ཐོབ་སྟེ། འདི་ལྟ་བུའི་སྦྱིན་གནས་མཉེས་པར་མ་བྱས་པས་ན་དེར་བདག་མིར་གྱུར་པ་ན། མི་བཀྲེན་པ་དང་། མི་དབུལ་པོ་དང་། བྲན་དུ་གྱུར་པ་དང་། གཞན་གྱི་དབང་དུ་སོང་བ་དང་། འདོད་པ་ལ་ཞེན་པའི་སེམས་ཅན་རྣམས་དང་། འདོད་པ་ལ་ཆགས་པ་རྣམས་དང་། མི་རིགས་པའི་སྤྱོད་པ་ལ་གནས་པ་རྣམས་དང་། ལོག་པར་ལྟ་བ་རྣམས་དང་། ཚུལ་ཁྲིམས་ལོག་པར་ཞུགས་པ་རྣམས་དང་། ལྟ་བ་ལོག་པར་ཞུགས་པ་རྣམས་དང་། མི་དགེ་བའི་རྩ་བ་གསུམ་ལ་རབ་ཏུ་གནས་པ་རྣམས་དང་། འགྲོ་བར་བྱ་བ་མ་ཡིན་པའི་འགྲོ་བ་བཞི་ལ་འགྲོ་བར་ཞུགས་པ་རྣམས་དང་། སྒྲིབ་པ་ལྔས་བསྒྲིབས་པ་རྣམས་དང་། བླ་མ་དྲུག་ལ་གུས་པར་མི་གནས་པ་རྣམས་དང་། དམ་པའི་ཆོས་མ་ཡིན་པ་བདུན་ལ་འཇུག་པ་རྣམས་དང་། ལོག་པ་བརྒྱད་ལ་ལོག་པར་ངེས་པ་རྣམས་དང་། གནོད་པ་དགུའི་དངོས་པོས་གནོད་པར་གྱུར་པ་རྣམས་དང་། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ལམ་ངན་པར་ཞུགས་པ་རྣམས་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་ལ་མངོན་པར་ཕྱོགས་པ་རྣམས་དང་། མཐོ་རིས་ཀྱི་ལམ་ལ་མ་ཕྱོགས་པ་རྣམས་དང་། དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་བ་རྣམས་དང་། སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་སོང་བ་རྣམས་དང་། བདུད་ཀྱི་དབང་དུ་སོང་བ་རྣམས་དང་། དགེ་བའི་ཆོས་ཡོངས་སུ་སྤངས་པ་རྣམས་དང་། མི་དགེ་བའི་ཆོས་ལ་སྤྱོད་པ་རྣམས་ཀྱི་དབྱུག་པས་བསྡིགས། འཇིགས་པས་བསྡིགས་ནས་མི་འདོད་བཞིན་དུ་བྱེད་ཅིང་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་པར་གྱུར་ཏེ བདག་གིས་ནི་ད་ལྟར་དེ་དག་མཉེས་པར་བྱས་པས་དགེ་བའི་ལུས་ཐོབ་ཀྱིས་སྦྱིན་གནས་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་བྱའོ། ། ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱའོ་ཞེས།
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Surrounded by evil friends, I was lazy, and so forth, and I had the sort of convictions that led me to believe that acts of homage, salutation, praise, reverence, respect, and honor would not have any consequences. Overcome by conceit, I engaged in much that was unwholesome, and when the fruits of these unwholesome actions ripened, I had to endure cruel states of existence where I had no inclination to serve those who are worthy of veneration. When I took a human existence I became a wretched human being, a poor human being. I became a servant under the rule of others, under the rule of beings who were greedy for pleasures of the senses, caught up in pleasures of the senses, who acted in coarse ways and upheld wrong views, whose morality was misguided, whose practice was misguided, and whose views were misguided, who engaged in the three unwholesome roots and the four wrong ways of approaching things, who were clouded by the five obscurations, who had no reverence for the six kinds of gurus, who resorted to the seven kinds of untrue teachings, who were caught up in the eight kinds of mistakes, who were overcome by the nine types of harmful acts, who were following the wrong path and engaging in the ten unwholesome forms of conduct, heading along the road to hell, who had turned away from the road that leads to the celestial realms, who had abandoned their spiritual friends and fallen into the hands of evil friends, who were under the sway of Māra, who had abandoned wholesome actions, and who were engaging in unwholesome actions. I was terrorized with sticks. I felt the terror of fear and had to act against my will. I was forced to carry loads and had to honor and serve them. In this kind of state, I had no inclination to serve those who are worthy of veneration. Now that I have attained this fortunate state, and now that my motivation is good, I will dedicate my life to those who are worthy of veneration and serve the teachers with no concern for my body, my life, or my honor.’

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་དྲུག་པ་དེ་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའ་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This is the sixth thought the bodhisatva cultivates, and so he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་རབ་ཏུ་རྟོག་ཏུ་གཞུག་པའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, to formulate this even more clearly, the Lord spoke these verses:

source: སྡིག་པའི་གྲོགས་ནི་ང་རྒྱལ་རྒྱགས་འཕེལ་བ། །བསྐུལ་པ་མང་པོ་རྒྱ་མཚོར་བསྟེན་པས་ན། །
en: “Throughout a great many oceans of eons, I have relied upon evil friends with rampant self-conceit,

source: མི་ཡི་ནང་དུ་སྐྱེས་ཀྱང་བྲན་དུ་འགྱུར། །
en: And although born a human being, I have been a slave

source: འཁོར་བའི་རྒྱུན་ཏུ་ཡུན་རིང་དུས་སུ་འཁོར། །
en: In the stream of cyclic existence for a long time.

source: མི་ལུས་རབ་ཏུ་རྙེད་པར་དཀའ་བ་ཡང་། །དེ་ནི་བདག་གིས་དཀའ་བས་ཐོབ་གྱུར་ཏེ། །གནས་པའི་ཡུལ་ནི་འཐུན་པ་བཟང་པོ་དང་། །སངས་རྒྱས་འབྱུང་དང་དལ་འབྱོར་དེ་བཞིན་ནོ།
en: “With great hardship, I have attained a human body, A thing that is incredibly difficult to attain, A wonderfully suitable dwelling place, And I am in the presence of a buddha—such precious opportunities.

source: །གྲོགས་པོ་གང་དག་མཆོག་ཏུ་རབ་བཟང་བ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་དང་ལམ་སྟོན་ཅིང་། །བྱང་ཆུབ་སེམས་ནི་རིན་ཆེན་འཕེལ་བྱེད་པ། །དེ་དག་བསྐལ་པ་བྱེ་བ་མང་པོས་རྙེད། །
en: “The very best of excellent friends Are those who give instructions on the bodhisatva’s path of training, Who have fully developed the jewel that is the mind of awakening, Obtained after many millions of eons.

source: ལུས་ནི་ཉམ་ཆུང་མི་རྟག་མི་བརྟན་ཏེ། །
en: “The body is fragile, impermanent, uncertain,

source: དབུ་བ་རྡོས་དང་ཆུ་ཡི་ཆུ་བུར་འདྲ། །
en: Like froth or bubbles appearing on water,

source: སྒྱུ་མ་ལྟ་བུ་གར་ལ་ལྟ་དང་མཚུངས། །
en: An illusion, like a staged play,

source: རྨི་ལམ་མཐོང་དང་འདྲིད་པར་སྨྲ་བ་བཞིན། །
en: A deception, and like images appearing in a dream.

source: སྲོག་ནི་ཡུན་ཐུང་ཚེ་ཡང་ཟད་པར་འགྱུར། ། ཇི་ལྟར་སྤྲིན་དང་གློག་ནི་མི་གནས་ལྟར། །སྐད་ཅིག་ཏུ་ནི་དེ་བཞིན་སྲོག་ཀྱང་འགྱུར། །
en: “Life is short and ends suddenly—Like clouds or lightning it does not remain. But even though one’s time is gone in an instant,

source: སྙིང་པོ་མེད་ལས་སྙིང་པོ་ལེན་པར་བྱེད། །
en: One can make good use of this insubstantial life.

source: གང་གིས་འདས་པའི་དུས་ཀྱི་བསྐལ་པ་ཡང་། །རྒྱ་མཚོ་བརྒྱ་ཕྲག་བསམ་ཡས་བསླུས་གྱུར་པ། །ང་རྒྱལ་རི་བོ་མན་དར་གཞོམ་པ་ཡི། །དུས་དང་ཚོད་དང་མན་ནི་ཉེར་གནས་ཀྱིས། །
en: “Even though he had done his mischief For inconceivable hundredfold oceans of eons, When the time came The proud one of the mountain Mandara was thrown down.

source: ལུས་ལ་སྡུག་པ་ཐམས་ཅད་རབ་སྤངས་ནས སྲོག་ལ་ཆགས་པ་མེད་པའི་ཡིད་ཀྱིས་ནི། །ང་དང་རྒྱགས་དང་དྲེགས་པ་སྤངས་གྱུར་ནས། ། ཡོན་ཏན་ལྡན་ལ་གུས་བཅས་རིམ་གྲོ་བྱ། །
en: “Completely leaving behind my love for this body And having no concern for this life, I will give up pride, conceit, and arrogance And honor and serve those who possess good qualities.

source: ང་དང་རྒྱགས་དང་དྲེགས་པ་སྤངས་གྱུར་ནས། ། ཕ་དང་མ་དང་བུ་ཕོ་རྣམས་དང་ནི། །འཇིག་རྟེན་བླ་མ་མཆོག་ཏུ་གང་གྲགས་ལ། །གུས་དང་བཅས་ཤིང་མཆོག་གི་རིམ་གྲོ་བྱ། །
en: “Giving up pride, conceit, and arrogance, I will, in the best possible ways, honor and serve The gurus who are celebrated as the most excellent in the world, As well as my mother, my father, and my brother.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མཆོག་ཞུགས་པ། །གང་དག་བདག་དང་བྱང་ཆུབ་འཐུན་སྤྱོད་ལ། །དགའ་དང་གུས་པ་བརྟན་པ་བསྐྱེད་བྱ་སྟེ། རིམ་གྲོ་བྱ་བའི་ཕྱིར་ནི་བརྩོན་པར་བྱ། །
en: “Those who help me act in accordance with the practice that leads to awakening Are bodhisatvas who dwell in supreme awakening. Therefore, with firm appreciation and respect for them, I will do my best to honor them.

source: སྐྱེ་དགུ་ང་རྒྱལ་ལྡན་པ་ང་རྒྱལ་སྤངས། ། མི་མཁས་ང་རྒྱལ་གཅད་ཅིང་གདུལ་བའི་ཕྱིར། །ཡེ་ཤེས་རྡོ་རྗེ་དག་གིས་བཅོམ་བྱས་ནས། ། རྒྱགས་དང་ང་རྒྱལ་རི་ནི་བསྙིལ་བར་བྱ། །
en: “Those who are proud do not know That discipline that is free from pride and subdues pride. I will strike them down with the vajra of knowledge And bring the mountains of pride and conceit crashing down.

source: བྱང་ཆུབ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱས་ཏེ། །
en: “Perfecting the supreme practice that leads to awakening,

source: བྱང་ཆུབ་སྙིང་པོ་མཆོག་ལ་གནས་གྱུར་ནས། །
en: I will take my place on the seat of awakening,

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་རྩོད་པ་རྣམས་བཏུལ་ཏེ། །
en: And subduing the hostile hosts of māras,

source: ཆུ་བོ་བཞི་ལས་སྲོག་ཆགས་བསྒྲལ་བར་བྱ། །
en: I will liberate beings from the four streams.

source: ཕྱོགས་བཅུ་དག་ན་མི་གང་ན་བ་རྣམས། །རང་གི་མི་གཙང་བར་ལྷུང་སྨད་པ་ལ། །བྱམས་པ་དང་ནི་སྙིང་རྗེའི་ཡིད་ཀྱིས་སུ། །མགོན་དང་སྐྱབས་དང་དཔུང་གཉེན་འགྱུར་བར་བྱ། །
en: “With a mind filled with love and compassion, I will be a protector, a defender, and a final refuge For those human beings in the ten directions who are suffering from afflictions And who are the victims of their own abhorrent filth.

source: སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་པའི་དུས་ལ་བབ། །
en: “I will employ the perfection of generosity when it is called for,

source: སངས་རྒྱས་ཡོན་ཏན་བསླབ་པ་བསླབ་ནུས་ཤེས། །
en: Follow the appropriate training set forth by the Buddha of the Śākya clan,

source: བཟོད་པ་བསྒོམ་པར་བྱ་བ་ཕུན་སུམ་ཚོགས། །མདུད་པ་མེད་པའི་བརྩོན་འགྲུས་བརྩོམ་པར་བྱ། །
en: Become accomplished in the cultivation of patient acceptance And apply myself with unobstructed vigor.

source: བསམ་གཏན་ཕ་རོལ་ཕྱིན་ཐོབ་ཕུན་སུམ་ཚོགས། །སེམས་གདུལ་བ་ཡི་དུས་ནི་ཉེ་བར་གནས། །
en: “Having attained the benefits of the perfection of meditation, Having made use of the opportunity to train the mind well,

source: ཐབས་དང་ཤེས་རབ་མཁས་ལ་གནས་གྱུར་ཏེ། །
en: Skilled in wisdom and skillful means,

source: བླ་མ་ཐམས་ཅད་ལ་ནི་བསྐོར་བ་བྱ། །
en: I will respectfully circumambulate all the gurus.

source: དེ་ལྟར་བསོད་ནམས་སྟོབས་དང་གཟི་བརྗིད་སྤེལ། །
en: “With my merit, strength, and splendor increasing in this way,

source: ཤེས་རབ་ཡེ་ཤེས་མཁས་པ་བསམ་མི་ཁྱབ།
en: With inconceivable mastery of wisdom and knowledge,

source: རང་དབང་དམ་པ་དག་གིས་མངོན་འཕགས་ཏེ། །
en: Having realized supreme self-mastery,

source: བྱུར་བུར་ཡོངས་སུ་བཀང་བའི་སྣོད་བྱིན་ནོ། །
en: I offer a bowl that is filled to the brim.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་དྲུག་པ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the sixth thought the bodhisatva cultivates, and so he applies himself to The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་སྡིག་པའི་གྲོགས་པོ་དང་ཕྲད་པས་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་ཉམས་པ། སྙོམ་ལས་ཅན། བླུན་པ། ལྐུག་པར་གྱུར་ཏེ། ལས་ནག་པོ་དང་། ནག་པོའི་རྣམ་པར་སྨིན་པའང་མེད། ལས་དཀར་པོ་དང་། དཀར་པོའི་རྣམ་པར་སྨིན་པའང་མེད། ལས་དཀར་གནག་དང་། དཀར་གནག་གི་རྣམ་པར་སྨིན་པའང་མེད། མི་གནག་ཅིང་དཀར་བའི་ལས་དང་། མི་གནག་ཅིང་དཀར་བའི་རྣམ་པར་སྨིན་པ་ཡང་མེད་དོ། ། ཞེས་དེ་ལྟར་ལྟ། དེ་ལྟར་བཟོད། དེ་ལྟར་མོས་པས། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ལ། བཙུན་པ་དག་དགེ་བ་གང་། མི་དགེ་བ་གང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་གང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་། བསྟེན་པར་བྱ་བ་གང་། བསྟེན་པར་མི་བྱ་བ་གང་། བྱ་བའི་རིགས་པ་གང་། བྱ་བའི་མི་རིགས་པ་གང་། ཅི་བྱས་ན་ ཡུན་རིང་པོར་གནོད་པ་དང་། མི་ཕན་པ་དང་། སྡུག་བསྔལ་བར་འགྱུར། ཅི་བྱས་ན་དོན་དང་། ཕན་པ་དང་། བདེ་བར་འགྱུར། ཞེས་མི་འདྲི་བ་དང་། ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པས་སྡིག་པ་མི་དགེ་བའི་ལས་མངོན་པར་འདུས་བྱས་ཏེ། མི་དགེ་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་འདི་ལྟ་སྟེ། སྦྱིན་གནས་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་མ་ཡིན་པ། དབང་པོ་མ་ཚང་བའི་མིར་གྱུར་ནས་ འདི་ལྟ་བུའི་སྦྱིན་གནས་མཉེས་པར་མ་བྱས་པས། བདག་མིར་གྱུར་པ་ན་ཡང་ལོང་བ། ལྐུག་པ། བླུན་པ། རྒུར་བ། དིག་པ། རྨོངས་པ། འོན་པར་གྱུར་ཏེ ལེགས་པར་བཤད་པ་དང་། ཉེས་པར་བཤད་པའི་དོན་ཤེས་པར་མི་ནུས་སོ། ། བདག་གིས་ནི་ད་ལྟར་མ་ཉེས་པར་བྱས་པས་འདི་ལྟ་སྟེ། དབང་པོ་ཚང་བ་དགེ་བའི་ལུས་ཐོབ་ཀྱིས། སྦྱིན་གནས་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་བྱ། ལུས་དང་སྲོག་ལ་མི་བལྟ་བར་བྱ། ལེགས་པར་བཤད་པ་དང་། ཉེས་པར་བཤད་པའི་དོན་ཀུན་ཤེས་པའི་མཐུ་ཡོད་པར་བྱ། སློབ་དཔོན་ལ་བཙུན་པ་དགེ་བ་གང་། མི་དགེ་བ་གང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་གང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་། བསྟེན་པ་གང་། མི་བསྟེན་པ་གང་། བྱ་བ་གང་། མི་བྱ་བ་གང་། ཅི་བྱས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་མངོན་དུ་འགྱུར། ཅི་བྱས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མངོན་དུ་འགྱུར་ཞེས་འདྲི་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་དོན་གྱི་ཕྱིར་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། འདི་ལྟར་སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་བླང་ངོ་སྙམ་ནས། ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Surrounded by evil friends, I was lazy, I had little vigor, I was idle and stupid, and I had the sort of opinions, the sort of tendencies, and the sort of convictions that led me to believe that negative actions have no negative consequences, that positive actions have no positive consequences, that mixed actions do not have both negative and positive consequences, and that the consequences of actions that are positive without anything negative would not be positive without anything negative. I did not consult with ascetics and brahmins and ask, “Venerable ones, what is wholesome, and what is unwholesome? What is irreproachable, and what is reproachable? What should one commit oneself to, and what should one not commit oneself to? What should be done, and what should not be done? What will prove to be useless, unhelpful, and bring suffering in the long run? What will prove to be meaningful, helpful, and bring happiness?” Overcome by conceit, I acted in a great many unwholesome ways, and when the fruits of these unwholesome actions ripened, I had to endure miserable states of existence as a human being who had no inclination to serve those who are worthy of veneration. When I took a human existence, I was incapacitated. I had a stutter. I was mute, blind, and deaf, and I could understand neither the meaning of teachings that were well spoken nor of those that were not well spoken. In this kind of state, I had no inclination to serve those who are worthy of veneration. Now that I have attained this fortunate state, with my faculties intact, I will dedicate my life to all those who are worthy of veneration, with no concern for my body or my life. When I am able to distinguish between teachings that are well spoken and those that are not well spoken, I will consult the teachers and ask, “Venerable ones, what is wholesome, and what is unwholesome? What is irreproachable, and what is reproachable? What should one commit oneself to, and what should one not commit oneself to? What should be done, and what should not be done? What actions will lead one to encounter the teachings on the śrāvaka and the pratyekabuddha? What actions will lead one to encounter the teachings on the bodhisatva?” When one inquires in this way, one will honor and serve one’s teacher, in order to learn The Collected Teachings on the Bodhisatva. One will maintain the attitude that one wishes to make use of this insubstantial body to attain a substantial body, such that one is even willing to give up one’s water flask.’ “This is the seventh thought the bodhisatva cultivates, and so he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་གསུངས་ཏེ། བདེ་བར་གཤེགས་པས་དེ་སྐད་བཀའ་སྩལ་ནས། སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: ཕན་པ་འདོད་ཕྱིར་བསྐལ་པ་བརྒྱ་མང་པོར། །དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་སྤངས་གྱུར་ནས། །
en: “I did not seek the benefits of having spiritual friends For many hundreds of eons.

source: དགེ་དང་མི་དགེ་ཁ་ན་མ་ཐོ་དང་། །ཁ་ན་མ་ཐོ་མེད་བྱས་འབྲས་མི་འདྲི། །ལྷག་པའི་ང་རྒྱལ་དབང་དུ་སོང་བ་ནི། །སེམས་དམྱལ་དུད་འགྲོ་གཤིན་རྗེའི་དབང་དུ་སོང་། །
en: I did not consult them about the results Or wholesome and unwholesome, reproachable and irreproachable actions. “Under the sway of arrogance, I ended up as a hell being, among animals, and ruled by Yama.

source: སྡིག་སེམས་གྲོགས་པོ་བསྟེན་པར་བྱས་པས་ན། །
en: Relying on friends with evil intentions,

source: བསྐལ་པ་བརྒྱ་མང་གིས་ནི་ངན་འགྲོར་འཕོས། །
en: I fell into the lower realms for many eons.

source: མི་ཡི་འཇིག་རྟེན་དབང་པོ་མ་ཚང་གྱུར། ། བསྐལ་པ་སྟོང་ཕྲག་མང་པོར་འཁྱམས་པའི་ལུས། །
en: “For many thousands of eons I roamed about In the human realm with my faculties deficient.

source: དགེ་དང་མི་དགེ་ཁ་ན་མ་ཐོ་དང་། །ཁ་ན་མ་ཐོ་མེད་བྱས་འབྲས་མི་ཤེས། ། རུ་སྦལ་མགྲིན་པ་ཤིང་མིག་ཆུད་འདྲ་བར། །མི་ཡི་ལུས་ནི་ཤིན་ཏུ་དཀའ་བར་ཐོབ། ། དབང་པོ་དག་ནི་ཚང་ཞིང་སྐྱེ་མཆེད་དགེ། ། མི་དལ་ཡོངས་སུ་སྤངས་ནས་དལ་བ་རྙེད། །
en: I did not know what was wholesome and what was unwholesome, Or the fruits of reproachable and irreproachable actions. “With great difficulty, I have obtained a human existence With my faculties intact and my senses sharp. With the unfavorable states of existence behind me, I have attained a favorable state, Just like the turtle putting its head through a yoke.

source: འཇིག་རྟེན་སྒྲོན་མ་མཛད་པ་མཉེས་བྱས་ནས། ། རྒྱལ་བས་བསྟན་ཆོས་འདོད་ཆགས་བྲལ་བ་ཐོབ། ། དགེ་དང་མི་དགེ་བྱ་བའི་འབྲས་བུ་དག ། འཇིག་རྟེན་གཙོ་ལ་བདག་འདྲི་དུས་ལ་བབ། །
en: “Having pleased those who are like lamps for the world, I have heard the Victorious One’s teachings, the Dharma that frees one from passion, And I now have the opportunity to consult the guru of the world About the results of wholesome and unwholesome actions:

source: འགྲོ་བར་སེར་སྣའི་མིར་འགྱུར་ཇི་ལྟ་བུ། །ཇི་ལྟར་སྦྱིན་བདག་སེར་སྣ་མེད་པར་འགྱུར། །
en: “ ‘What becomes of the miser, And what of one who gives without miserliness?

source: ཇི་ལྟར་གཡོ་ངན་བརྐམ་པ་ཚུལ་ཁྲིམས་འཆལ། །ཚུལ་ཁྲིམས་ནོར་ཀུན་སྲུང་བ་ཇི་ལྟ་བུ།
en: What becomes of one who is deceitful, greedy, and immoral, And what of one who unfailingly guards the riches of his moral conduct? “

source: མི་ནི་ཁྲོ་དང་འཁྲུག་པར་ཇི་ལྟར་འགྱུར། །ཁྲོ་མེད་བཟོད་པའི་སྟོབས་སུ་ཇི་ལྟར་འགྱུར། །
en: What becomes of a man who is angry and out of control,And what of one who does not become angry but has the power of patience?

source: ཇི་ལྟར་ལེ་ལོ་ཅན་དང་གཡེང་ཡིད་འགྱུར། །བརྩོན་འཕགས་བསམ་གཏན་དགའ་བ་ཇི་ལྟ་བུ།
en: What becomes of the lazy and restless, And what of one whose vigor is awakened and whose meditation is joyful?

source: །ཇི་ལྟར་འཆལ་པའི་ཤེས་རབ་བླུན་ལྐུག་འགྱུར། ། ཇི་ལྟར་ཤེས་རབ་ལྡན་ཞིང་བདེན་གཏམ་དགའ། །
en: “ ‘What becomes of those who are dull minded and whose understanding is distorted, And what of the wise who rejoice in the truth of the teachings?

source: ཇི་ལྟར་བྱང་ཆུབ་སྤྱོད་པ་གཅིག་སེམས་པས། །སྤྱོད་པ་བཟང་པོ་ཐམས་ཅད་ཚོལ་བར་འགྱུར། །
en: What becomes of one whose attention to the practice that leads to awakening is undivided And who wholeheartedly strives to do good?

source: ཇི་ལྟར་འགྲོ་བ་ཀུན་ལ་བྱམས་པ་བགྱིད། །ཇི་ལྟར་ངན་སོང་སོང་བའི་སེམས་ཅན་འདྲེན། །ཇི་ལྟར་ཆོས་ཀྱི་དགའ་བས་མི་ངོམས་ཡིད། །བྱང་ཆུབ་སྤྱོད་པ་སྡེ་སྣོད་ཡོངས་སུ་ཚོལ། །
en: “ ‘What becomes of one who has love for all beings without exception, And what of one who rescues sentient beings from the lower realms? What happens to one whose joy in the Dharma is ceaseless And who strives to practice the path to awakening contained in The Collected Teachings?

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་རབ་འབྱམས་ཞིང་རྣམས་ན། ། འཇིག་རྟེན་བླ་མ་བཞུགས་པར་ཇི་ལྟར་འགྲོ། །
en: “ ‘What becomes of one who seeks out the gurus in this world, Wherever they may dwell in the vast regions in the ten directions?

source: ཕྱག་འཚལ་བསོད་ནམས་བྱེད་པ་ཇི་ལྟ་བུ། །ཀུན་ཏུ་བཟང་པོ་སྤྱོད་པ་ཅི་འདྲ་འདྲི། །སློབ་དཔོན་བླ་མ་དག་ལ་བདག་འདྲི་བ། །དེ་ཡི་དུས་ནི་དི་རིང་ཉེར་གནས་ཏེ། །
en: What of one who pays honor? What of one who acts virtuously? What of one who does good in every possible way?’ This is what I ask. “As the appropriate time has now come, I present these questions to the teachers, the gurus.

source: བླ་མའི་གནས་སུ་གནས་ལས་ཉན་དགའ་སྟེ། །
en: Being with the gurus, joyfully receiving their instruction,

source: སློབ་དཔོན་ཡིད་མགུ་བྱེད་པ་ཇི་ལྟ་བུ།
en: How can I gladden the hearts of my teachers?

source: །སངས་རྒྱས་སྲས་ཀྱི་སེམས་ནི་བསྐྱེད་གྱུར་ནས། ། སྟོབས་དང་བསོད་ནམས་ཡངས་པའི་བློ་གྲོས་ཅན། །ངེས་པར་མཆོག་གི་ཡེ་ཤེས་སྟོབས་ལྡན་པས། །དགའ་བའི་ཡིད་ཀྱིས་སྣོད་གང་ཆུ་ཡང་འབུལ། །
en: “This is the motivation that a son of the Buddha, Noble minded with power and merit, cultivates. With strength and the power of the highest knowledge, He gladly gives away his water flask.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བདུན་པ་འདི་བསྐྱེད་ནས བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་དོན་གྱི་ཕྱིར་སློབ་དཔོན་ལ་ནི་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the seventh thought the bodhisatva cultivates, and for the sake of The Collected Teachings on the Bodhisatva, he honors and serves his teacher to the extent that he will even be willing to give up his water flask.
